08-motorbike/motorBike-4-nucleos/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

72
(
    frontAndBack
    {
        type            patch;
        nFaces          360;
        startFace       1054684;
    }
    inlet
    {
        type            patch;
        nFaces          72;
        startFace       1055044;
    }
    outlet
    {
        type            patch;
        nFaces          72;
        startFace       1055116;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5349;
        startFace       1055188;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       1060537;
    }
    motorBike_frt-fairing:001%1
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          5385;
        startFace       1060697;
    }
    motorBike_windshield:002%2
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          50;
        startFace       1066082;
    }
    motorBike_rr-wh-rim:005%5
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          131;
        startFace       1066132;
    }
    motorBike_rr-wh-rim:010%10
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          354;
        startFace       1066263;
    }
    motorBike_fr-wh-rim:011%11
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          505;
        startFace       1066617;
    }
    motorBike_fr-wh-brake-disk:012%12
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          46;
        startFace       1067122;
    }
    motorBike_frame:016-shadow%13
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          103;
        startFace       1067168;
    }
    motorBike_rear-susp:014%14
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          821;
        startFace       1067271;
    }
    motorBike_rear-susp:014-shadow%15
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          459;
        startFace       1068092;
    }
    motorBike_frame:016%16
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          62;
        startFace       1068551;
    }
    motorBike_rr-wh-rim:005-shadow%17
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          56;
        startFace       1068613;
    }
    motorBike_rr-wh-chain-hub:022%22
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          126;
        startFace       1068669;
    }
    motorBike_rearseat%24
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          421;
        startFace       1068795;
    }
    motorBike_frt-fairing%25
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          619;
        startFace       1069216;
    }
    motorBike_windshield%26
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          386;
        startFace       1069835;
    }
    motorBike_headlights%27
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          154;
        startFace       1070221;
    }
    motorBike_driversseat%28
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          358;
        startFace       1070375;
    }
    motorBike_rear-body%29
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          2041;
        startFace       1070733;
    }
    motorBike_fuel-tank%30
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          881;
        startFace       1072774;
    }
    motorBike_exhaust%31
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          2340;
        startFace       1073655;
    }
    motorBike_rr-wh-rim%32
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          1377;
        startFace       1075995;
    }
    motorBike_fr-mud-guard%33
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          614;
        startFace       1077372;
    }
    motorBike_fr-wh-rim%34
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          576;
        startFace       1077986;
    }
    motorBike_fr-wh-brake-disk%35
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          436;
        startFace       1078562;
    }
    motorBike_fr-brake-caliper%36
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          159;
        startFace       1078998;
    }
    motorBike_fr-wh-tyre%37
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          1098;
        startFace       1079157;
    }
    motorBike_hbars%38
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          522;
        startFace       1080255;
    }
    motorBike_fr-forks%39
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          1091;
        startFace       1080777;
    }
    motorBike_chain%40
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          459;
        startFace       1081868;
    }
    motorBike_rr-wh-tyre%41
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          1842;
        startFace       1082327;
    }
    motorBike_square-dial%42
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          6;
        startFace       1084169;
    }
    motorBike_round-dial%43
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          15;
        startFace       1084175;
    }
    motorBike_dial-holder%44
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          85;
        startFace       1084190;
    }
    motorBike_rear-susp%45
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          1726;
        startFace       1084275;
    }
    motorBike_rear-brake-lights%46
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          54;
        startFace       1086001;
    }
    motorBike_rear-light-bracket%47
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          157;
        startFace       1086055;
    }
    motorBike_frame%48
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          2013;
        startFace       1086212;
    }
    motorBike_rear-mud-guard%49
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          650;
        startFace       1088225;
    }
    motorBike_rear-susp-spring-damp%50
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          83;
        startFace       1088875;
    }
    motorBike_fairing-inner-plate%51
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          439;
        startFace       1088958;
    }
    motorBike_clutch-housing%52
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          925;
        startFace       1089397;
    }
    motorBike_radiator%53
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          51;
        startFace       1090322;
    }
    motorBike_water-pipe%54
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          94;
        startFace       1090373;
    }
    motorBike_water-pump%55
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          72;
        startFace       1090467;
    }
    motorBike_engine%56
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          2307;
        startFace       1090539;
    }
    motorBike_rear-shock-link%57
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          22;
        startFace       1092846;
    }
    motorBike_rear-brake-fluid-pot-bracket%58
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          44;
        startFace       1092868;
    }
    motorBike_rear-brake-fluid-pot%59
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          53;
        startFace       1092912;
    }
    motorBike_footpeg%60
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          89;
        startFace       1092965;
    }
    motorBike_rr-wh-chain-hub%61
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          124;
        startFace       1093054;
    }
    motorBike_rear-brake-caliper%62
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          145;
        startFace       1093178;
    }
    motorBike_rider-helmet%65
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          759;
        startFace       1093323;
    }
    motorBike_rider-visor%66
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          165;
        startFace       1094082;
    }
    motorBike_rider-boots%67
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          1004;
        startFace       1094247;
    }
    motorBike_rider-gloves%68
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          309;
        startFace       1095251;
    }
    motorBike_rider-body%69
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          4556;
        startFace       1095560;
    }
    motorBike_frame:0%70
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          37;
        startFace       1100116;
    }
    motorBike_frt-fairing:001-shadow%74
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          3207;
        startFace       1100153;
    }
    motorBike_windshield-shadow%75
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          247;
        startFace       1103360;
    }
    motorBike_fr-mud-guard-shadow%81
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          380;
        startFace       1103607;
    }
    motorBike_fr-wh-brake-disk-shadow%83
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          197;
        startFace       1103987;
    }
    motorBike_rear-mud-guard-shadow%84
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          396;
        startFace       1104184;
    }
    motorBike_rear-susp-spring-damp-shadow%85
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          46;
        startFace       1104580;
    }
    motorBike_radiator-shadow%86
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          21;
        startFace       1104626;
    }
    motorBike_rear-shock-link-shadow%87
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          15;
        startFace       1104647;
    }
    motorBike_rear-brake-fluid-pot-bracket-shadow%88
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          20;
        startFace       1104662;
    }
    motorBike_rr-wh-chain-hub-shadow%89
    {
        type            wall;
        inGroups        List<word> 
2
(
motorBikeGroup
wall
)
;
        nFaces          69;
        startFace       1104682;
    }
)

// ************************************************************************* //
